Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/giving_evidence_by_television_link.html.txt.tmx
Source language: en
Languages: ga

source: Giving evidence by television-link
ga: Fianaise a thabhairt le nasc teilifíse

source: The general rule in the courts in Ireland, is that a witness must be present in the courtroom to give oral evidence
ga: Tá riail ghinearálta i gcúirteanna na hÉireann nach mór don fhinné a bheith i láthair sa seomra cúirte le fianaise bhéil a thabhairt

source: However, recent legislation, Section 13 of the Criminal Evidence Act 1992, has introduced the concept of video-link evidence in cases
ga: Ach, tá reachtaíocht tugtha isteach le deireanas a thugann cead fianaise a thabhairt le nasc-físe isteach sa seomra cúirte

source: Instead of coming into the courtroom, the witness sits in another room and gives evidence via a live television link
ga: In áit a theacht isteach i seomra na cúirte bíonn an finné suite i seomra eile agus tugann sé/sí fianaise tríd nasc beo teilifíse

source: A television monitor is placed in the court, which transmits the image of the witness, and the witness has the benefit of a television monitor in his/her room that transmits the image of what is going on in the court
ga: Cuirtear teilifíseán isteach sa chúirt, a thaispeáineann an finné agus bíonn teilifíseán ina s(h)eomra féin ag an bhfinné gur féidir leis/léi a bhfuil ag tarlú sa seomra cúirte a fheiceáil

source: The purpose of TV-link evidence is to make it easier for some witnesses to give evidence
ga: Cuirtear an deis ar fáil fianaise a thabhairt le nasc teilifíse ar mhaithe len é a dhéanamh níos éasca do fhinnéithe faoi leith fianaise a thabhairt

source: The courtroom can be very intimidating and being in the same room as the accused may be very difficult for some witnesses
ga: Is féidir leis an seomra cúirte a bheith fíor scanrúil agus tá sé fíor dheacair ar fhinnéithe faoi leith a bheith sa seomra céanna leis an gcúisí

source: In criminal proceedings, there are few situations where TV-link evidence will be acceptable:
ga: Níl ach cúinsí fíor éisceachtúla ina mbeidh cead fianaise a thabhairt le nasc teilifíse nuair is cás coiriúil atá i gceist:

source: • If a witness lives outside Ireland, in some cases, he or she may give evidence through a live television link
ga: • Má tá cónaí ar fhinné taobh amuigh d'Éire, i gcásanna áirid, is féidir leis/léi fianaise a thabhairt tríd nasc beo teilifíse

source: • If the proceedings relate to a sexual or violent offence, the judge may decide that any witness (other than the accused) may give evidence through a live TV link
ga: • Má bhaineann an cás le coir ghnéis nó le foréigean, is féidir leis an mbreitheamh cinneadh a dhéanamh gur féidir le finné ar bith (seachas an cúisí) fianaise a thabhairt tríd nasc beo teilifíse

source: • If the proceedings relate to a sexual or violent offence, witnesses under 18 years of age and people with mental disabilities are allowed give evidence by live TV link unless there is a good reason why they should not
ga: • Má bhaineann an cás le coir ghnéis nó le foréigean, tugtar cead go minic d'fhinnéithe atá faoi ocht mbliana déag d'aois agus do dhaoine faoi mhíchumas intinne fianaise a thabhairt tríd nasc beo teilifíse ach amháin sa chás go bhfuil fáth maith ann nár cheart dóibh

source: The judge may decide that the questions should be asked through an intermediary (for example a social worker) and that they should be asked in a way that is appropriate for the age and mental ability of the witness
ga: Nuair atá leanbh nó duine faoi mhíchumas intinne ag tabhairt fianaise tríd nasc beo teilifíse ní bhíonn bréagfhoilt ná róbaí dhá gcaitheamh ag an mbreitheamh ná ag na habhchóidí sa chúirt

source: In civil proceedings there is provision to allow someone to give evidence through a live TV link, including where the witness is not in Ireland, providing the facilities are availble and the case is suitable
ga: Is féidir leis an mbreitheamh cinneadh a dhéanamh go mbeadh na ceisteanna curtha tríd idirghabhálaí (oibrí sóisialta mar shampla) agus go mbeadh siad curtha ar bhealach atá oiriúnach d'aois agus do chumas intinne an fhinné

source: Video-link evidence may also be allowed in civil cases concerning the welfare of a child or a person with a mental disability
ga: Tugtar cead fianaise a thabhairt tríd nasc-físe freisin i gcásanna sibhialta a bhaineann le leas an linbh nó an duine faoi mhíchumas intinne

source: The judge must decide that it is appropriate that the child or person with a mental disability give evidence by a television link and he or she may also decide that the questions should be put through an intermediary
ga: Ní mór don bhreitheamh cinneadh a dhéanamh go bhfuil sé feiliúnach go mbeadh an leanbh nó an duine faoi mhíchumas intinne ag tabhairt fianaise tríd nasc teilifise agus is féidir leis/léi cinneadh a dhéanamh freisin go mbeadh na ceisteanna curtha ar an bhfinné tríd idirghabhálaí

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
